In [1]:
dataset_id = "ssats_modeled"
!bq --location=US mk --dataset {dataset_id}

Dataset 'first-planet-266901:ssats_modeled' successfully created.

### create new modeled tables using CTAS statements

In [34]:
%%bigquery

CREATE TABLE ssats_modeled.facility_information AS
SELECT *
FROM
(SELECT DISTINCT CASEID, STATE, CAST(CASE WHEN CTYPEHI2 = 1 THEN 'Yes' WHEN CTYPEHI2 = 0 THEN 'No' ELSE Null END as String) as CTYPEHI2, CTYPE1, OWNE_2SHP AS OWNERSHP,
FROM ssats_staging. ssats_2018_u
WHERE CASEI_3 IS NOT NULL
UNION DISTINCT
 
SELECT DISTINCT CASEID, STATE, CAST(CASE WHEN CTYPEHI2 = 1 THEN 'Yes' WHEN CTYPEHI2 = 0 THEN 'No' ELSE Null END as String) as CTYPEHI2, CTYPE1, OW_5E_2SHP AS OWNERSHP,
FROM ssats_staging. ssats_2017_u
WHERE CASEI_3 IS NOT NULL
UNION DISTINCT

SELECT DISTINCT CASEID, STATE, CAST(CASE WHEN CTYPEHI2 = 1 THEN 'Yes' WHEN CTYPEHI2 = 0 THEN 'No' ELSE Null END as String) as CTYPEHI2, CTYPE1, OWNE_2SHP AS OWNERSHP,
FROM ssats_staging. ssats_2016_u
WHERE CASEI_3 IS NOT NULL
UNION DISTINCT 
 
SELECT DISTINCT CASEID, STATE, CAST(CASE WHEN CTYPEHI2 = 1 THEN 'Yes' WHEN CTYPEHI2 = 0 THEN 'No' ELSE Null END as String) as CTYPEHI2, CTYPE1, OWNE_2SHP AS OWNERSHP,
FROM ssats_staging. ssats_2015_u
WHERE CASEI_3 IS NOT NULL
UNION DISTINCT 
 
SELECT DISTINCT CASEID, STATE, CAST(CASE WHEN CTYPEHI2 = 1 THEN 'Yes' WHEN CTYPEHI2 = 0 THEN 'No' ELSE Null END as String) as CTYPEHI2, CTYPE1, OWNE_2SHP AS OWNERSHP,
FROM ssats_staging. ssats_2014_u
WHERE CASEI_3 IS NOT NULL)


ORDER BY STATE;

Empty DataFrame
Columns: []
Index: []

In [39]:
%%bigquery

CREATE TABLE ssats_modeled.facility_treatment AS
SELECT *
FROM
(SELECT DISTINCT CASEID, OTP, CAST(CASE WHEN T_2EAT_1T = 1 THEN 'Yes' WHEN T_2EAT_1T = 0 THEN 'No' ELSE Null END as String) as TREATMT, S_2VC71 AS SRVC71, CTYPEHI1, CTYPE_2C1 AS CTYPERC1, S_2VC85 AS SRVC85,
FROM ssats_staging. ssats_2018_u
WHERE CASEID IS NOT NULL
UNION DISTINCT
 
SELECT DISTINCT CASEID, OTP, CAST(CASE WHEN T_2EAT_1T = 1 THEN 'Yes' WHEN T_2EAT_1T = 0 THEN 'No' ELSE Null END as String) as TREATMT, S_2VC71 AS SRVC71, CTYPEHI1, CTYPE_2C1 AS CTYPERC1, S_2VC85 AS SRVC85,
FROM ssats_staging. ssats_2017_u
WHERE CASEID IS NOT NULL
UNION DISTINCT
 
SELECT DISTINCT CASEID, OTP, CAST(CASE WHEN T_2EAT_1T = 1 THEN 'Yes' WHEN T_2EAT_1T = 0 THEN 'No' ELSE Null END as String) as TREATMT, S_2VC71 AS SRVC71, CTYPEHI1, CTYPE_2C1 AS CTYPERC1, S_2VC85 AS SRVC85,
FROM ssats_staging. ssats_2016_u
WHERE CASEID IS NOT NULL
UNION DISTINCT
 
SELECT DISTINCT CASEID, OTP, CAST(CASE WHEN T_2EAT_1T = 1 THEN 'Yes' WHEN T_2EAT_1T = 0 THEN 'No' ELSE Null END as String) as TREATMT, S_2VC71 AS SRVC71, CTYPEHI1, CTYPE_2C1 AS CTYPERC1, S_2VC85 AS SRVC85,
FROM ssats_staging. ssats_2015_u
WHERE CASEID IS NOT NULL
UNION DISTINCT
 
SELECT DISTINCT CASEID, OTP, CAST(CASE WHEN T_2EAT_1T = 1 THEN 'Yes' WHEN T_2EAT_1T = 0 THEN 'No' ELSE Null END as String) as TREATMT, S_2VC71 AS SRVC71, CTYPEHI1, CTYPE_2C1 AS CTYPERC1, S_2VC85 AS SRVC85,
FROM ssats_staging. ssats_2014_u
WHERE CASEID IS NOT NULL)

ORDER BY CASEID;

Empty DataFrame
Columns: []
Index: []

In [35]:
%%bigquery

CREATE TABLE ssats_modeled.facility_services AS
SELECT *
FROM
(SELECT DISTINCT CASEID, CAST(CASE WHEN SIGNLANG = 1 THEN 'Yes' WHEN SIGNLANG = 0 THEN 'No' ELSE Null END as String) as SIGNLANG, CTYPE_1L AS CTYPEML, LANG16, S_2VC108 AS SRVC108,S_2VC113 AS SRVC113,
FROM ssats_staging. ssats_2018_u
WHERE CASEID IS NOT NULL
UNION DISTINCT
 
SELECT DISTINCT CASEID,CAST(CASE WHEN SIG_5LA_5G = 1 THEN 'Yes' WHEN SIG_5LA_5G = 0 THEN 'No' ELSE Null END as String) as SIGNLANG, CTYPE_1L AS CTYPEML, LA_5G16 AS LANG16, S_2VC108 AS SRVC108,S_2VC113 AS SRVC113,
FROM ssats_staging. ssats_2017_u
WHERE CASEID IS NOT NULL
UNION DISTINCT
 
SELECT DISTINCT CASEID, CAST(CASE WHEN SIGNLANG = 1 THEN 'Yes' WHEN SIGNLANG = 0 THEN 'No' ELSE Null END as String) as SIGNLANG, CTYPE_1L AS CTYPEML, LANG16, S_2VC108 AS SRVC108,S_2VC113 AS SRVC113,
FROM ssats_staging. ssats_2016_u
WHERE CASEID IS NOT NULL
UNION DISTINCT
 
SELECT DISTINCT CASEID, CAST(CASE WHEN SIGNLANG = 1 THEN 'Yes' WHEN SIGNLANG = 0 THEN 'No' ELSE Null END as String) as SIGNLANG, CTYPE_1L AS CTYPEML, LANG16, S_2VC108 AS SRVC108,S_2VC113 AS SRVC113,
FROM ssats_staging. ssats_2015_u
WHERE CASEID IS NOT NULL
UNION DISTINCT
 
SELECT DISTINCT CASEID, CAST(CASE WHEN SIGNLANG = 1 THEN 'Yes' WHEN SIGNLANG = 0 THEN 'No' ELSE Null END as String) as SIGNLANG, CTYPE_1L AS CTYPEML, LANG16, S_2VC108 AS SRVC108, S_2VC113 AS SRVC113,
FROM ssats_staging. ssats_2014_u
WHERE CASEID IS NOT NULL)

ORDER BY CASEID

Empty DataFrame
Columns: []
Index: []

### check for primary key

In [36]:
%%bigquery
select count(*) from ssats_modeled.facility_information

     f0_
0  70818

In [37]:
%%bigquery
select count(distinct CASEID) from ssats_modeled.facility_information

     f0_
0  70818

In [40]:
%%bigquery
select count(*) from ssats_modeled.facility_treatment

     f0_
0  70818

In [41]:
%%bigquery
select count(distinct CASEID) from ssats_modeled.facility_treatment

     f0_
0  70818

In [42]:
%%bigquery
select count(*) from ssats_modeled.facility_services

     f0_
0  70818

In [43]:
%%bigquery
select count(distinct CASEID) from ssats_modeled.facility_services

     f0_
0  70818

### check for foreign key

In [45]:
%%bigquery

SELECT COUNT(*) 
FROM ssats_modeled.facility_information as t2 
LEFT JOIN ssats_modeled.facility_services as t1 ON t2.CASEID = t1.CASEID
WHERE t1.CASEID IS NULL

   f0_
0    0

In [46]:
%%bigquery

SELECT COUNT(*) 
FROM ssats_modeled.facility_services as t2 
LEFT JOIN ssats_modeled.facility_information as t1 ON t2.CASEID = t1.CASEID
WHERE t1.CASEID IS NULL

   f0_
0    0

In [47]:
%%bigquery

SELECT COUNT(*) 
FROM ssats_modeled.facility_services as t2 
LEFT JOIN ssats_modeled.facility_treatment as t1 ON t2.CASEID = t1.CASEID
WHERE t1.CASEID IS NULL

   f0_
0    0

In [48]:
%%bigquery

SELECT COUNT(*) 
FROM ssats_modeled.facility_treatment as t2 
LEFT JOIN ssats_modeled.facility_services as t1 ON t2.CASEID = t1.CASEID
WHERE t1.CASEID IS NULL

   f0_
0    0

In [49]:
%%bigquery

SELECT COUNT(*) 
FROM ssats_modeled.facility_treatment as t2 
LEFT JOIN ssats_modeled.facility_information as t1 ON t2.CASEID = t1.CASEID
WHERE t1.CASEID IS NULL

   f0_
0    0

In [50]:
%%bigquery

SELECT COUNT(*) 
FROM ssats_modeled.facility_information as t2 
LEFT JOIN ssats_modeled.facility_treatment as t1 ON t2.CASEID = t1.CASEID
WHERE t1.CASEID IS NULL

   f0_
0    0